//------------------------------------------------------------------------------
// Pot.cpp - содержит реализацию общего горшка с едой
//------------------------------------------------------------------------------

#include "Pot.h"

//------------------------------------------------------------------------------
// Ввод параметров горшка с едой
void Pot::In(ifstream &ifst) {
    ifst >> portions_count_;
}

// Случайный ввод параметров диагональной матрицы
void Pot::InRnd() {
    portions_count_ = random.getInt(0, 40);
}

//------------------------------------------------------------------------------
// Вывод параметров диагональной матрицы в форматируемый поток
void Pot::Out(ofstream &ofst) {
    ofst << "Горшок с едой с количеством порций" << portions_count_ << "\n";
}

void Pot::decreasePortion() {
    lock_guard<mutex> lock(m);
    --portions_count_;
}

bool Pot::isEmpty() {
    return portions_count_ == 0;
}

